[
    {
        "url": "https://en.wikipedia.org/wiki/Elon_Musk",
        "content": "Elon Reeve Musk (/ˈiːlɒn ˈmʌsk/; born June 28, 1971) is a South African-born Canadian American business magnate, investor,[8][9] and engineer.[10] He is the founder, CEO, and lead designer of SpaceX;[11] co-founder, CEO, and product architect of Tesla, Inc.; and co-founder and CEO of Neuralink. In December 2016, he was ranked 21st on the Forbes list of The World's Most Powerful People.[12] As of February 2018, he has a net worth of $20.8 billion and is listed by Forbes as the 53rd richest person in the world.[13] Born in Pretoria, Musk taught himself computer programming at the age of 12. He moved to Canada when he was 17 to attend Queen's University. He transferred to the University of Pennsylvania two years later, where he received an economics degree from the Wharton School and a degree in physics from the College of Arts and Sciences. He began a PhD in applied physics and material sciences at Stanford University in 1995 but dropped out after two days to pursue an entrepreneurial career. He subsequently co-founded Zip2, a web software company, which was acquired by Compaq for $340 million in 1999. Musk then founded X.com, an online payment company. It merged with Confinity in 2000 and became PayPal, which was bought by eBay for $1.5 billion in October 2002.[18]"
    },
    {
        "url": "https://en.wikipedia.org/wiki/Engineer",
        "content": "Engineers, as practitioners of engineering, are people who invent, design, analyse, build and test machines, systems, structures and materials to fulfill objectives and requirements while considering the limitations imposed by practicality, regulation, safety, and cost.[1][2] The word engineer (Latin ingeniator[3]) is derived from the Latin words ingeniare (\"to contrive, devise\") and ingenium (\"cleverness\").[4][5] The foundational qualifications of an engineer typically include a 4-year bachelor's degree in an engineering discipline, or in some jurisdictions, a master's degree in an engineering discipline plus 4–6 years of peer-reviewed professional practice (culminating in a project report or thesis) and passage of engineering board examinations. The work of engineers forms the link between scientific discoveries and their subsequent applications to human and business needs and quality of life.[1]"
    },
    {
        "url": "https://en.wikipedia.org/wiki/Sport",
        "content": "Sport (British English) or sports (American English) includes all forms of competitive physical activity or games which,[1] through casual or organised participation, aim to use, maintain or improve physical ability and skills while providing enjoyment to participants, and in some cases, entertainment for spectators.[2] Usually the contest or game is between two sides, each attempting to exceed the other. Some sports allow a tie game; others provide tie-breaking methods, to ensure one winner and one loser. A number of such two-sided contests may be arranged in a tournament producing a champion. Many sports leagues make an annual champion by arranging games in a regular sports season, followed in some cases by playoffs. Hundreds of sports exist, from those between single contestants, through to those with hundreds of simultaneous participants, either in teams or competing as individuals. In certain sports such as racing, many contestants may compete, each against each other, with one winner."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Russia",
        "content": "Russia (Russian: Росси́я, tr. Rossiya, IPA: [rɐˈsʲijə]), also officially known as the Russian Federation[12] (Russian: Росси́йская Федерaция, tr. Rossiyskaya Federatsiya, IPA: [rɐˈsʲijskəjə fʲɪdʲɪˈratsɨjə]), is a sovereign country in Eurasia.[13] At 17,125,200 square kilometres (6,612,100 sq mi),[14] Russia is the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area,[15][16][17] and the ninth most populous, with over 144 million people at the end of December 2017.[6] The European western part of the country is much more populated and urbanised than the eastern; about 77% of the population live in European Russia. Russia's capital Moscow is one of the largest cities in the world; other major urban centers include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Usa",
        "content": "The United States of America (USA), commonly known as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.[fn 6] At 3.8 million square miles (9.8 million km2) and with over 325 million people, the United States is the world's third- or fourth-largest country by total area[fn 7] and the third-most populous country as well as the largest Christian-majority country. The capital is Washington, D.C., and the largest city by population is New York City. Forty-eight states and the capital's federal district are contiguous and located in North America between Canada and Mexico. The state of Alaska is in the northwest corner of North America, bordered by Canada to the east and across the Bering Strait from Russia to the west. The state of Hawaii is an archipelago in the mid-Pacific Ocean. The U.S. territories are scattered about the Pacific Ocean and the Caribbean Sea, stretching across nine official time zones. The extremely diverse geography, climate, and wildlife of the United States make it one of the world's 17 megadiverse countries.[19]"
    },
    {
        "url": "https://en.wikipedia.org/wiki/Moscow",
        "content": "Moscow (/ˈmɒskoʊ/ or /ˈmɒskaʊ/; Russian: Москва́, tr. Moskva, IPA: [mɐˈskva] (About this sound listen)) is the capital and most populous city of Russia, with 12.2 million residents within the city limits[11] and 17.1 million within the urban area.[12] Moscow is recognized as a Russian federal city. Moscow is a major political, economic, cultural, and scientific centre of Russia and Eastern Europe, as well as the largest city entirely on the European continent. By broader definitions Moscow is among the world's largest cities, being the 14th largest metro area, the 18th largest agglomeration, the 15th largest urban area, and the 11th largest by population within city limits worldwide. According to Forbes 2013,[13] Moscow has been ranked as the ninth most expensive city in the world by Mercer and has one of the world's largest urban economies, being ranked as an alpha global city according to the Globalization and World Cities Research Network, and is also one of the fastest growing tourist destinations in the world according to the MasterCard Global Destination Cities Index."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Tallinn",
        "content": "Tallinn (/ˈtɑːlɪn/[4][5] or /ˈtælɪn/,[6] Estonian pronunciation: [ˈtɑlʲˑinˑ]; names in other languages) is the capital and largest city of Estonia. It is situated on the northern coast of the country, on the shore of the Gulf of Finland, 80 km (50 mi) south of Helsinki, east of Stockholm, north of Riga and west of Saint Petersburg in Harju County. From the 13th century until 1918 (and briefly during the Nazi occupation of Estonia from 1941 to 1944), in languages other than Estonian the city was known as Reval.[7] Tallinn occupies an area of 159.2 km2 (61.5 sq mi) and has a population of 449,160.[8] Tallinn, first mentioned in 1219, received city rights in 1248,[9] but the earliest human settlements date back 5,000 years.[10] The initial claim over the land was laid by the Danes in 1219, after a successful raid of Lyndanisse led by Valdemar II of Denmark, followed by a period of alternating Scandinavian and German rule. Due to its strategic location, the city became a major trade hub, especially from the 14th to the 16th century, when it grew in importance as part of the Hanseatic League."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Yandex",
        "content": "Yandex N.V. (/ˈjʌndɛks/; Russian: Яндекс, IPA: [ˈjandəks]) is a multinational corporation specializing in Internet-related services and products. Although most of its assets are in Russia, the company is incorporated in the Netherlands due to irregularities in Russian law[according to whom?]. It is the largest technology company in Russia[2] and the largest search engine on the Internet in Russian, with a market share of over 52%.[3] The Yandex.ru home page is the 4th most popular website in Russia.[4] It also has the largest market share of any search engine in the Commonwealth of Independent States and is the 5th largest search engine worldwide after Google, Baidu, Bing, and Yahoo!."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Google",
        "content": "Google LLC[5] is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University, California. Together, they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An Initial public offering (IPO) took place on August 19, 2004, and Google moved to its new headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google, Alphabet's leading subsidiary, will continue to be the umbrella company for Alphabet's Internet interests. Upon completion of the restructure, Sundar Pichai was appointed CEO of Google, replacing Larry Page, who became the CEO of Alphabet."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Albert_Einstein",
        "content": "Albert Einstein (14 March 1879 – 18 April 1955) was a German-born theoretical physicist[5] who developed the theory of relativity, one of the two pillars of modern physics (alongside quantum mechanics).[4][6]:274 His work is also known for its influence on the philosophy of science.[7][8] He is best known by the general public for his mass–energy equivalence formula E = mc2 (which has been dubbed \"the world's most famous equation\").[9] He received the 1921 Nobel Prize in Physics \"for his services to theoretical physics, and especially for his discovery of the law of the photoelectric effect\",[10] a pivotal step in the evolution of quantum theory."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Black_hole",
        "content": "A black hole is a region of spacetime exhibiting such strong gravitational effects that nothing—not even particles and electromagnetic radiation such as light—can escape from inside it.[1] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[2][3] The boundary of the region from which no escape is possible is called the event horizon. Although the event horizon has an enormous effect on the fate and circumstances of an object crossing it, no locally detectable features appear to be observed.[4] In many ways a black hole acts like an ideal black body, as it reflects no light.[5][6] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is on the order of billionths of a kelvin for black holes of stellar mass, making it essentially impossible to observe."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Sun",
        "content": "The Sun is the star at the center of the Solar System. It is a nearly perfect sphere of hot plasma,[14][15] with internal convective motion that generates a magnetic field via a dynamo process.[16] It is by far the most important source of energy for life on Earth. Its diameter is about 1.39 million kilometers, i.e. 109 times that of Earth, and its mass is about 330,000 times that of Earth, accounting for about 99.86% of the total mass of the Solar System.[17] About three quarters of the Sun's mass consists of hydrogen (~73%); the rest is mostly helium (~25%), with much smaller quantities of heavier elements, including oxygen, carbon, neon, and iron.[18]"
    },
    {
        "url": "https://en.wikipedia.org/wiki/Earth",
        "content": "Earth is the third planet from the Sun and the only object in the Universe known to harbor life. According to radiometric dating and other sources of evidence, Earth formed over 4.5 billion years ago.[24][25][26] Earth's gravity interacts with other objects in space, especially the Sun and the Moon, Earth's only natural satellite. Earth revolves around the Sun in 365.26 days, a period known as an Earth year. During this time, Earth rotates about its axis about 366.26 times.[n 5] Earth's axis of rotation is tilted, producing seasonal variations on the planet's surface.[27] The gravitational interaction between the Earth and Moon causes ocean tides, stabilizes the Earth's orientation on its axis, and gradually slows its rotation.[28] Earth is the densest planet in the Solar System and the largest of the four terrestrial planets."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Software",
        "content": "Computer software, or simply software, is a part of a computer system that consists of data or computer instructions, in contrast to the physical hardware from which the system is built. In computer science and software engineering, computer software is all information processed by computer systems, programs and data. Computer software includes computer programs, libraries and related non-executable data, such as online documentation or digital media. Computer hardware and software require each other and neither can be realistically used on its own."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Node.js",
        "content": "Node.js is an open-source, cross-platform JavaScript run-time environment for executing JavaScript code server-side. Historically, JavaScript was used primarily for client-side scripting, in which scripts written in JavaScript are embedded in a webpage's HTML, to be run client-side by a JavaScript engine in the user's web browser. Node.js enables JavaScript to be used for server-side scripting, and runs scripts server-side to produce dynamic web page content before the page is sent to the user's web browser. Consequently, Node.js has become one of the foundational elements of the \"JavaScript everywhere\" paradigm,[5] allowing web application development to unify around a single programming language, rather than rely on a different language for writing server side scripts."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Open-source_software",
        "content": "Open-source software (OSS) is computer software with its source code made available with a license in which the copyright holder provides the rights to study, change, and distribute the software to anyone and for any purpose.[1] Open-source software may be developed in a collaborative public manner. According to scientists who studied it, open-source software is a prominent example of open collaboration.[2] The term is often written without a hyphen as \"open source software\"."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Linux",
        "content": "Linux (/ˈlɪnəks/ (About this sound listen) LIN-əks)[9][10] is a family of free and open-source software operating systems built around the Linux kernel. Typically, Linux is packaged in a form known as a Linux distribution (or distro for short) for both desktop and server use. The defining component of a Linux distribution is the Linux kernel,[11] an operating system kernel first released on September 17, 1991, by Linus Torvalds.[12][13][14] Linux was originally developed for personal computers based on the Intel x86 architecture, but has since been ported to more platforms than any other operating system.[15] Because of the dominance of the Linux kernel-based Android OS on smartphones, Linux has the largest installed base of all general-purpose operating systems.[16] Linux is also the leading operating system on servers and other big iron systems such as mainframe computers, and the only OS used on TOP500 supercomputers (since November 2017, having before gradually eliminated all competitors).[17][18] It is used by around 2.3% of desktop computers."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Linus_Torvalds",
        "content": "Linus Benedict Torvalds (/ˈliːnəs ˈtɔːrvɔːldz/;[5] Swedish: [ˈliːn.ɵs ˈtuːr.valds] (About this sound listen); born December 28, 1969) is a Finnish-American software engineer[2][6] who is the creator, and for a long time, principal developer of the Linux kernel, which became the kernel for operating systems such as the Linux operating systems, Android, and Chrome OS. He also created the distributed revision control system Git and the diving logging and planning software Subsurface. He was honored, along with Shinya Yamanaka, with the 2012 Millennium Technology Prize by the Technology Academy Finland \"in recognition of his creation of a new open source operating system for computers leading to the widely used Linux kernel\".[7] He is also the recipient of the 2014 IEEE Computer Society Computer Pioneer Award[8] and the 2018 IEEE Masaru Ibuka Consumer Electronics Award."
    },
    {
        "url": "https://en.wikipedia.org/wiki/JavaScript",
        "content": "JavaScript (/ˈdʒɑːvəˌskrɪpt/[6]), often abbreviated as JS, is a high-level, interpreted programming language. It is a language which is also characterized as dynamic, weakly typed, prototype-based and multi-paradigm. Alongside HTML and CSS, JavaScript is one of the three core technologies of World Wide Web content engineering. It is used to make webpages interactive and provide online programs, including video games. The majority of websites employ it, and all modern web browsers support it without the need for plug-ins by means of a built-in JavaScript engine. Each of the many JavaScript engines represent a different implementation of JavaScript, all based on the ECMAScript specification, with some engines not supporting the spec fully, and with many engines supporting additional features beyond ECMA."
    },
    {
        "url": "https://en.wikipedia.org/wiki/Artificial_neural_network",
        "content": "Artificial neural networks (ANNs) or connectionist systems are computing systems vaguely inspired by the biological neural networks that constitute animal brains.[1] Such systems \"learn\" (i.e. progressively improve performance on) tasks by considering examples, generally without task-specific programming. For example, in image recognition, they might learn to identify images that contain cats by analyzing example images that have been manually labeled as \"cat\" or \"no cat\" and using the results to identify cats in other images. They do this without any a priori knowledge about cats, e.g., that they have fur, tails, whiskers and cat-like faces. Instead, they evolve their own set of relevant characteristics from the learning material that they process."
    }
]
